scripts/global/834/32852552

<p>After upgrading our SharePoint servers from 2010 -> 2013 some code that used to be working is no longer working. My suspicion is that it's not the script that's the problem, but the schemas being invoked by it:</p>  <pre><code>  function GetSoapMessage(listName, qField, qValue, subCat, node){         var soapEnv = "";         currentSubCat = subCat;         currentCat = node;         soapEnv ="&lt;soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' " +         "xmlns:xsd='http://www.w3.org/2001/XMLSchema' "+           "xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'&gt;"+         "&lt;soap:Body&gt;"+             "&lt;GetListItems xmlns='http://schemas.microsoft.com/sharepoint/soap/'&gt;"+               "&lt;listName&gt;" + listName + "&lt;/listName&gt;"+               "&lt;viewName&gt;&lt;/viewName&gt;"+                "&lt;query&gt;&lt;Query xmlns=''&gt;&lt;Where&gt;&lt;Eq&gt;&lt;FieldRef Name='"+ qField + "'/&gt;&lt;Value Type='Text'&gt;" + qValue + "&lt;/Value&gt;&lt;/Eq&gt;&lt;/Where&gt;&lt;/Query&gt;&lt;/query&gt;"+                    "&lt;viewFields&gt;&lt;ViewFields xmlns=''&gt;&lt;FieldRef Name='Title' /&gt;&lt;FieldRef Name='HWID' /&gt;&lt;FieldRef Name='HWCategory' /&gt;&lt;FieldRef Name='SubCategory' /&gt;&lt;FieldRef Name='PIPVendor' /&gt;&lt;FieldRef Name='MoreDetails' /&gt;&lt;/ViewFields&gt;&lt;/viewFields&gt;"+               "&lt;rowLimit&gt;4999&lt;/rowLimit&gt;"+               "&lt;queryOptions&gt;&lt;QueryOptions xmlns=''&gt;&lt;IncludeMandatoryColumns&gt;TRUE&lt;/IncludeMandatoryColumns&gt;&lt;ViewAttributes Scope='RecursiveAll'/&gt;&lt;/QueryOptions&gt;&lt;/queryOptions&gt;"+             "&lt;/GetListItems&gt;"+           "&lt;/soap:Body&gt;"+         "&lt;/soap:Envelope&gt;"; </code></pre>  <p>The bottom link ("http://schemas.microsoft.com/sharepoint/soap/'>) brings me to a page that says "The resource you are looking for has been removed, had its name changed, or is temporarily unavailable." Does anyone know where this resource has been moved to, or if the ones from 2001 arestill usable?</p>  <p>Thanks in advance for any help.</p>